# pandas 入门

pandas引入约定：
```python
import pandas as pd
```
因为Series和DataFrame用的次数非常多，所以将其引入本地命名空间中会更方便：
```python
from pandas import Series, DataFrame
```

In [3]:
import pandas as pd
import numpy as np

C:\code\Anaconda\lib\site-packages\numpy\core\__init__.py:29: UserWarning: loaded more than 1 DLL from .libs:
C:\code\Anaconda\lib\site-packages\numpy\.libs\libopenblas.CSRRD7HKRKC3T3YXA7VY7TAZGLSWDKW6.gfortran-win_amd64.dll
C:\code\Anaconda\lib\site-packages\numpy\.libs\libopenblas.IPBC74C7KURV7CB2PKT5Z5FNR3SIBV4J.gfortran-win_amd64.dll
  stacklevel=1)

## pandas的数据结构介绍

### Series

#### 创建Series:
1. 列表
2. 字典

In [2]:
obj = pd.Series([4, 7, -5, 3])

In [3]:
obj

0    4
1    7
2   -5
3    3
dtype: int64

In [4]:
sdata = {'Ohio': 35000, 'Texas': 71000, 'Oregon': 16000, 'Utah': 5000}

In [5]:
obj3 = pd.Series(sdata)

In [6]:
obj3

Ohio      35000
Texas     71000
Oregon    16000
Utah       5000
dtype: int64

>如果只传入一个字典，则结果Series中的索引就是原字典的键**（有序排列）**。

可以传入排好序的字典的键以改变顺序：

In [7]:
states = ['California', 'Ohio', 'Oregon', 'Texas']

In [8]:
obj4 = pd.Series(sdata, index=states)

In [9]:
obj4

California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
dtype: float64

可以将Series看成是一个定长的有序字典，因为它是索引值到数据值的一个映射。它可以用在许多原本需要字典参数的函数中：

In [10]:
'b' in obj2

NameError: name 'obj2' is not defined

In [11]:
'e' in obj2

NameError: name 'obj2' is not defined

Series的字符串表现形式为：索引在左边，值在右边。

由于我们没有为数据指定索引，于是会自动创建一个0到N-1（N为数据的长度）的整数型索引。

你可以通过Series 的*values和index*属性获取其数组表示形式和索引对象：

In [12]:
obj.values

array([ 4,  7, -5,  3], dtype=int64)

In [13]:
obj.index

RangeIndex(start=0, stop=4, step=1)

#### 索引

索引可以在创建时指定，也可以直接对index赋值

In [14]:
obj2 = pd.Series([4, 7, -5, 3], index=['d', 'b', 'a', 'c'])

In [15]:
obj2

d    4
b    7
a   -5
c    3
dtype: int64

In [16]:
obj2.index

Index(['d', 'b', 'a', 'c'], dtype='object')

In [17]:
obj2.index = ['a', 'b', 'c', 'd']

In [18]:
obj2

a    4
b    7
c   -5
d    3
dtype: int64

可以通过索引的方式选取Series中的单个或一组值

In [19]:
obj2['a']

4

In [20]:
obj2[['c', 'a', 'd']]

c   -5
a    4
d    3
dtype: int64

Series对象本身及其索引都有一个name属性

In [21]:
obj4.name = 'population'

In [22]:
obj4.index.name = 'state'

In [23]:
obj4

state
California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
Name: population, dtype: float64

### DataFrame

#### 创建

![](可以传递给dataframe构造函数的数据.jpg)

最常用的一种是直接传入一个由等长列表或NumPy数组组成的字典

In [24]:
data = {'state': ['Ohio', 'Ohio', 'Ohio', 'Nevada', 'Nevada', 'Nevada'],
'year': [2000, 2001, 2002, 2001, 2002, 2003],
'pop': [1.5, 1.7, 3.6, 2.4, 2.9, 3.2]}
frame = pd.DataFrame(data)

In [25]:
frame

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9
5  Nevada  2003  3.2

>全部列会被有序排列

指定了列序列，则DataFrame的列就会按照指定顺序进行排列

In [26]:
pd.DataFrame(data, columns=['year', 'state', 'pop'])

   year   state  pop
0  2000    Ohio  1.5
1  2001    Ohio  1.7
2  2002    Ohio  3.6
3  2001  Nevada  2.4
4  2002  Nevada  2.9
5  2003  Nevada  3.2

如果传入的列在数据中找不到，就会在结果中产生缺失值：

In [27]:
frame2 = pd.DataFrame(data, columns=['year', 'state', 'pop', 'debt'],
....: index=['one', 'two', 'three', 'four',
....: 'five', 'six'])

In [28]:
frame2

       year   state  pop debt
one    2000    Ohio  1.5  NaN
two    2001    Ohio  1.7  NaN
three  2002    Ohio  3.6  NaN
four   2001  Nevada  2.4  NaN
five   2002  Nevada  2.9  NaN
six    2003  Nevada  3.2  NaN

通过类似字典标记的方式或属性的方式，可以将DataFrame的列获取为一个Series：

In [29]:
frame2.state

one        Ohio
two        Ohio
three      Ohio
four     Nevada
five     Nevada
six      Nevada
Name: state, dtype: object

In [30]:
frame2['state']

one        Ohio
two        Ohio
three      Ohio
four     Nevada
five     Nevada
six      Nevada
Name: state, dtype: object

列可以通过赋值的方式进行修改

In [31]:
frame2['debt'] = 16.5

In [32]:
frame2

       year   state  pop  debt
one    2000    Ohio  1.5  16.5
two    2001    Ohio  1.7  16.5
three  2002    Ohio  3.6  16.5
four   2001  Nevada  2.4  16.5
five   2002  Nevada  2.9  16.5
six    2003  Nevada  3.2  16.5

In [33]:
frame2['debt'] = np.arange(6.)

将列表或数组赋值给某个列时，其长度必须跟DataFrame的长度相匹配。

如果赋值的是一个Series，就会精确匹配DataFrame的索引，所有的空位都将被填上缺失

In [34]:
val = pd.Series([-1.2, -1.5, -1.7], index=['two', 'four'
, 'five'])

In [35]:
frame2['debt'] = val

In [36]:
frame2

       year   state  pop  debt
one    2000    Ohio  1.5   NaN
two    2001    Ohio  1.7  -1.2
three  2002    Ohio  3.6   NaN
four   2001  Nevada  2.4  -1.5
five   2002  Nevada  2.9  -1.7
six    2003  Nevada  3.2   NaN

为不存在的列赋值会创建出一个新列。

关键字del用于删除列。

In [37]:
frame2['eastern'] = frame2.state == 'Ohio'

In [38]:
frame2

       year   state  pop  debt  eastern
one    2000    Ohio  1.5   NaN     True
two    2001    Ohio  1.7  -1.2     True
three  2002    Ohio  3.6   NaN     True
four   2001  Nevada  2.4  -1.5    False
five   2002  Nevada  2.9  -1.7    False
six    2003  Nevada  3.2   NaN    False

In [39]:
del frame2['eastern']

In [40]:
frame2

       year   state  pop  debt
one    2000    Ohio  1.5   NaN
two    2001    Ohio  1.7  -1.2
three  2002    Ohio  3.6   NaN
four   2001  Nevada  2.4  -1.5
five   2002  Nevada  2.9  -1.7
six    2003  Nevada  3.2   NaN

>通过索引方式返回的列只是相应数据的**视图**而已，并不是副本。因此，对返回的Series所做的任何就地修改全都会反映到源DataFrame上。
>
>通过Series的*copy方法*即可指定复制列。

DataFrame的index和columns都有一个name属性

In [41]:
frame2.index.name = 'year'; frame2.columns.name = 'state'

In [42]:
frame2

state  year   state  pop  debt
year
one    2000    Ohio  1.5   NaN
two    2001    Ohio  1.7  -1.2
three  2002    Ohio  3.6   NaN
four   2001  Nevada  2.4  -1.5
five   2002  Nevada  2.9  -1.7
six    2003  Nevada  3.2   NaN

如果DataFrame各列的数据类型不同，values属性的dtype就会选用能兼容所有列的数据类型：

In [43]:
frame2.values

array([[2000, 'Ohio', 1.5, nan],
       [2001, 'Ohio', 1.7, -1.2],
       [2002, 'Ohio', 3.6, nan],
       [2001, 'Nevada', 2.4, -1.5],
       [2002, 'Nevada', 2.9, -1.7],
       [2003, 'Nevada', 3.2, nan]], dtype=object)

#### 索引对象

构建Series或DataFrame时，所用到的任何数组或其他序列的标签都会被转换成一个Index

In [44]:
obj = pd.Series(range(3), index=['a', 'b', 'c'])

In [45]:
index = obj.index

In [46]:
index

Index(['a', 'b', 'c'], dtype='object')

In [47]:
index[1] = 'd'

TypeError: Index does not support mutable operations

>Index对象是不可变的，因此用户不能对其进行修改

Index的功能也类似一个固定大小的集合,但与python的集合不同，pandas的Index可以包含**重复**的标签

In [ ]:
dup_labels = pd.Index(['foo', 'foo', 'bar', 'bar'])

In [48]:
dup_labels

NameError: name 'dup_labels' is not defined

>选择重复的标签，会显示所有的结果。

![](index的方法和属性.jpg)

## 基本功能

### 重新索引

pandas对象的一个重要方法是reindex，其作用是创建一个新对象，它的数据符合新的索引。

![](reindex-parameter.jpg)

In [49]:
obj = pd.Series([4.5, 7.2, -5.3, 3.6], index=['d', 'b','a', 'c'])

In [50]:
obj

d    4.5
b    7.2
a   -5.3
c    3.6
dtype: float64

In [51]:
obj2 = obj.reindex(['a', 'b', 'c', 'd', 'e'])

In [52]:
obj2

a   -5.3
b    7.2
c    3.6
d    4.5
e    NaN
dtype: float64

对于**时间序列**这样的有序数据，重新索引时可能需要做一些插值处理。

*method选项*即可达到此目的，例如，使用ffill可以实现前向值填充：

In [53]:
obj3 = pd.Series(['blue', 'purple', 'yellow'], index=[0, 2, 4])

In [54]:
obj3

0      blue
2    purple
4    yellow
dtype: object

In [55]:
obj3.reindex(range(6), method='ffill')

0      blue
1      blue
2    purple
3    purple
4    yellow
5    yellow
dtype: object

只传递一个序列时，会重新索引结果的行
列可以用columns关键字重新索引

### 丢弃指定轴上的项

drop方法返回的是一个在指定轴上删除了指定值的新对象

In [57]:
obj = pd.Series(np.arange(5.), index=['a', 'b', 'c', 'd', 'e'])

In [58]:
obj

a    0.0
b    1.0
c    2.0
d    3.0
e    4.0
dtype: float64

In [61]:
new_obj = obj.drop('c')

In [62]:
new_obj

a    0.0
b    1.0
d    3.0
e    4.0
dtype: float64

In [63]:
obj.drop(['d', 'c'])

a    0.0
b    1.0
e    4.0
dtype: float64

用标签序列调用drop会从行标签（axis 0）删除值

通过传递axis=1或axis='columns'可以删除列的值

许多函数，如drop，会修改Series或DataFrame的大小或形状，设置inplace=True, 可以就地修改对象，不会返回新的对象

### 索引、选取和过滤

#### Series
索引值不只是整数。

In [4]:
obj = pd.Series(np.arange(4.), index=['a', 'b', 'c', 'd'])

In [5]:
obj

a    0.0
b    1.0
c    2.0
d    3.0
dtype: float64

In [6]:
obj['b']

1.0

In [7]:
obj[2:4]

c    2.0
d    3.0
dtype: float64

In [8]:
obj[['b', 'a', 'd']]

b    1.0
a    0.0
d    3.0
dtype: float64

In [9]:
obj[[1, 3]]

b    1.0
d    3.0
dtype: float64

In [10]:
obj[obj < 2]

a    0.0
b    1.0
dtype: float64

In [11]:
obj['b':'c'] = 5

In [12]:
obj

a    0.0
b    5.0
c    5.0
d    3.0
dtype: float64

>利用标签的切片运算与普通的Python切片运算不同，其末端是包含的

#### DataFrame

用一个值或序列对DataFrame进行索引其实就是获取一个或多个**列**

In [13]:
data = pd.DataFrame(np.arange(16).reshape((4, 4)),
.....: index=['Ohio', 'Colorado', 'Utah','New York'],
.....: columns=['one', 'two', 'three', 'four'])

In [14]:
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [15]:
data['two']

Ohio         1
Colorado     5
Utah         9
New York    13
Name: two, dtype: int32

In [17]:
data[['three', 'one']]

          three  one
Ohio          2    0
Colorado      6    4
Utah         10    8
New York     14   12

In [18]:
data[:2]

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7

In [19]:
data[data['three'] > 5]

          one  two  three  four
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [20]:
data < 5

            one    two  three   four
Ohio       True   True   True   True
Colorado   True  False  False  False
Utah      False  False  False  False
New York  False  False  False  False

In [21]:
data[data < 5] = 0

In [22]:
data

          one  two  three  four
Ohio        0    0      0     0
Colorado    0    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

### 用loc和iloc进行选取

![](pandas索引.jpg)

In [23]:
ser = pd.Series(np.arange(3.))

In [24]:
ser

0    0.0
1    1.0
2    2.0
dtype: float64

In [25]:
ser[:1]

0    0.0
dtype: float64

In [26]:
ser.loc[:1]

0    0.0
1    1.0
dtype: float64

In [27]:
ser.iloc[:1]

0    0.0
dtype: float64

### 算术运算和数据对齐

在将对象相加时，如果存在不同的索引对，则结果的索引就是该索引对的并集。

自动的数据对齐操作在不重叠的索引处引入了NA值。缺失值会在算术运算过程中传播。

In [29]:
df1 = pd.DataFrame(np.arange(9.).reshape((3, 3)), columns=list('bcd'),
.....: index=['Ohio', 'Texas', 'Colorado'])

In [31]:
df2 = pd.DataFrame(np.arange(12.).reshape((4, 3)), columns=list('bde'),
...: index=['Utah', 'Ohio', 'Texas', 'Oregon'])

In [32]:
df1

            b    c    d
Ohio      0.0  1.0  2.0
Texas     3.0  4.0  5.0
Colorado  6.0  7.0  8.0

In [33]:
df2

          b     d     e
Utah    0.0   1.0   2.0
Ohio    3.0   4.0   5.0
Texas   6.0   7.0   8.0
Oregon  9.0  10.0  11.0

In [34]:
df1 + df2

            b   c     d   e
Colorado  NaN NaN   NaN NaN
Ohio      3.0 NaN   6.0 NaN
Oregon    NaN NaN   NaN NaN
Texas     9.0 NaN  12.0 NaN
Utah      NaN NaN   NaN NaN

In [35]:
df1 = pd.DataFrame({'A': [1, 2]})

In [36]:
df2 = pd.DataFrame({'B': [3, 4]})

In [37]:
df1

   A
0  1
1  2

In [38]:
df2

   B
0  3
1  4

In [39]:
df1 * df2

    A   B
0 NaN NaN
1 NaN NaN

### 在算术方法中填充值

In [40]:
df1 = pd.DataFrame(np.arange(12.).reshape((3, 4)),
.....: columns=list('abcd'))

In [41]:
df2 = pd.DataFrame(np.arange(20.).reshape((4, 5)),
.....: columns=list('abcde'))

In [42]:
df1

     a    b     c     d
0  0.0  1.0   2.0   3.0
1  4.0  5.0   6.0   7.0
2  8.0  9.0  10.0  11.0

In [43]:
df2

      a     b     c     d     e
0   0.0   1.0   2.0   3.0   4.0
1   5.0   6.0   7.0   8.0   9.0
2  10.0  11.0  12.0  13.0  14.0
3  15.0  16.0  17.0  18.0  19.0

In [44]:
df1 + df2

      a     b     c     d   e
0   0.0   2.0   4.0   6.0 NaN
1   9.0  11.0  13.0  15.0 NaN
2  18.0  20.0  22.0  24.0 NaN
3   NaN   NaN   NaN   NaN NaN

In [45]:
df1.add(df2, fill_value=0)

      a     b     c     d     e
0   0.0   2.0   4.0   6.0   4.0
1   9.0  11.0  13.0  15.0   9.0
2  18.0  20.0  22.0  24.0  14.0
3  15.0  16.0  17.0  18.0  19.0

![](算术方法.jpg)

Series和DataFrame的算术方法每个都有一个副本，以字母r开头，它会翻转参数。

In [46]:
1 / df1

       a         b         c         d
0    inf  1.000000  0.500000  0.333333
1  0.250  0.200000  0.166667  0.142857
2  0.125  0.111111  0.100000  0.090909

In [47]:
df1.rdiv(1)

       a         b         c         d
0    inf  1.000000  0.500000  0.333333
1  0.250  0.200000  0.166667  0.142857
2  0.125  0.111111  0.100000  0.090909

在对Series或DataFrame重新索引时，也可以指定一个填充值

In [48]:
df1.reindex(columns=df2.columns, fill_value=0)

     a    b     c     d  e
0  0.0  1.0   2.0   3.0  0
1  4.0  5.0   6.0   7.0  0
2  8.0  9.0  10.0  11.0  0

### DataFrame和Series之间的运算

默认情况下，DataFrame和Series之间的算术运算会将Series的索引匹配到DataFrame的**列**，然后沿着行一直向下广播

In [49]:
frame = pd.DataFrame(np.arange(12.).reshape((4, 3)),
.....: columns=list('bde'),
.....: index=['Utah', 'Ohio', 'Texas', 'Oregon'])

In [50]:
series = frame.iloc[0]

In [52]:
frame

          b     d     e
Utah    0.0   1.0   2.0
Ohio    3.0   4.0   5.0
Texas   6.0   7.0   8.0
Oregon  9.0  10.0  11.0

In [53]:
series

b    0.0
d    1.0
e    2.0
Name: Utah, dtype: float64

In [54]:
frame - series

          b    d    e
Utah    0.0  0.0  0.0
Ohio    3.0  3.0  3.0
Texas   6.0  6.0  6.0
Oregon  9.0  9.0  9.0

如果某个索引值在DataFrame的列或Series的索引中找不到，则参与运算的两个对象就会被重新索引以形成并集

In [55]:
series2 = pd.Series(range(3), index=['b', 'e', 'f'])

In [56]:
series2

b    0
e    1
f    2
dtype: int64

In [57]:
frame + series2

          b   d     e   f
Utah    0.0 NaN   3.0 NaN
Ohio    3.0 NaN   6.0 NaN
Texas   6.0 NaN   9.0 NaN
Oregon  9.0 NaN  12.0 NaN

如果你希望匹配行且在列上广播，则必须使用算术运算方法

传入的轴号就是希望匹配的轴

In [60]:
series3 = frame['d']

In [61]:
series3

Utah       1.0
Ohio       4.0
Texas      7.0
Oregon    10.0
Name: d, dtype: float64

In [62]:
frame.sub(series3, axis='index')

          b    d    e
Utah   -1.0  0.0  1.0
Ohio   -1.0  0.0  1.0
Texas  -1.0  0.0  1.0
Oregon -1.0  0.0  1.0

### 函数应用和映射

NumPy的ufuncs（元素级数组方法）也可用于操作pandas对象

In [63]:
frame = pd.DataFrame(np.random.randn(4, 3), columns=list('bde'), index=['Utah', 'Ohio', 'Texas', 'Oregon'])

In [64]:
frame

               b         d         e
Utah    1.362540  0.158243  1.661342
Ohio    1.066698 -0.042855  0.253307
Texas  -0.804561 -0.439767 -0.002822
Oregon  3.131078  0.129063 -0.024825

In [65]:
np.abs(frame)

               b         d         e
Utah    1.362540  0.158243  1.661342
Ohio    1.066698  0.042855  0.253307
Texas   0.804561  0.439767  0.002822
Oregon  3.131078  0.129063  0.024825

DataFrame的apply方法将函数应用到由各列或行所形成的**一维数组**上

In [68]:
f = lambda x: x.max() - x.min()

In [69]:
frame.apply(f)

b    3.935639
d    0.598010
e    1.686167
dtype: float64

如果传递axis='columns'到apply，这个函数会在每行执行

In [71]:
frame.apply(f, axis='columns')

Utah      1.503099
Ohio      1.109554
Texas     0.801739
Oregon    3.155903
dtype: float64

对于元素级的Python函数，使用applymap

In [75]:
format = lambda x: '%.2f' % x

In [76]:
frame.applymap(format)

            b      d      e
Utah     1.36   0.16   1.66
Ohio     1.07  -0.04   0.25
Texas   -0.80  -0.44  -0.00
Oregon   3.13   0.13  -0.02

对于Series，有一个用于应用元素级函数的map方法

In [77]:
frame['e'].map(format)

Utah       1.66
Ohio       0.25
Texas     -0.00
Oregon    -0.02
Name: e, dtype: object

### 排序和排名

#### sort

要对行或列索引进行排序（按字典顺序），可使用sort_index方法，它将返回一个已排序的新对象

对于DataFrame，则可以根据任意一个轴上的索引进行排序

数据默认是按升序排序的，但也可以降序排序

要根据一个或多个列中的值进行排序，将一个或多个列的名字传递给sort_values的by选项即可

In [79]:
frame = pd.DataFrame(np.arange(8).reshape((2, 4)),
.....: index=['three', 'one'],
.....: columns=['d', 'a', 'b', 'c'])

In [80]:
frame

       d  a  b  c
three  0  1  2  3
one    4  5  6  7

In [81]:
frame.sort_index()

       d  a  b  c
one    4  5  6  7
three  0  1  2  3

In [82]:
frame.sort_index(axis=1)

       a  b  c  d
three  1  2  3  0
one    5  6  7  4

In [83]:
frame.sort_index(axis=1, ascending=False)

       d  c  b  a
three  0  3  2  1
one    4  7  6  5

In [88]:
frame = pd.DataFrame({'b': [4, 7, -3, 2], 'a': [0, 1, 0, 1]})

In [89]:
frame

   b  a
0  4  0
1  7  1
2 -3  0
3  2  1

In [90]:
frame.sort_values(by='b')

   b  a
2 -3  0
3  2  1
0  4  0
1  7  1

In [91]:
frame.sort_values(by=['b', 'a'])

   b  a
2 -3  0
3  2  1
0  4  0
1  7  1

对于Series，可以使用sort_index()和sort_values()

在排序时，任何缺失值默认都会被放到Series的末尾

In [85]:
obj = pd.Series([4, np.nan, 7, np.nan, -3, 2])

In [86]:
obj.sort_values()

4   -3.0
5    2.0
0    4.0
2    7.0
1    NaN
3    NaN
dtype: float64

#### rank方法

默认情况下，rank是通过“为各组分配一个平均排名”的方式破坏平级关系

![](rank方法.jpg)

举个例子，对于数值，默认情况就是根据数值大小关系给出排名（rank）

### 带有重复标签的轴索引

In [93]:
obj = pd.Series(range(5), index=['a', 'a', 'b', 'b', 'c'])

In [94]:
obj

a    0
a    1
b    2
b    3
c    4
dtype: int64

In [96]:
obj.index.is_unique

False

In [97]:
obj['a']

a    0
a    1
dtype: int64

In [98]:
obj['c']

4

In [99]:
df = pd.DataFrame(np.random.randn(4, 3), index=['a', 'a', 'b', 'b'])

In [100]:
df

          0         1         2
a  0.243847 -0.481098 -0.938995
a  1.375582 -1.614699  0.188266
b  1.563690 -1.011780 -1.109118
b  0.026322 -1.595204 -1.103146

In [101]:
df.loc['a']

          0         1         2
a  0.243847 -0.481098 -0.938995
a  1.375582 -1.614699  0.188266

## 汇总和计算描述统计

![](描述和汇总统计.jpg)

#### 约简方法

常见的有sum, mean...降低了维度

![](约简方法的选项.jpg)

#### 间接统计

idxmax, idxmin, argmax, argmin...返回索引

#### 累计型

产生中间计算结果

In [107]:
df.cumsum()

    one  two
a  1.40  NaN
b  8.50 -4.5
c   NaN  NaN
d  9.25 -5.8

#### 其他

describe

In [102]:
df = pd.DataFrame([[1.4, np.nan], [7.1, -4.5],
.....: [np.nan, np.nan], [0.75, -1.3]],
.....: index=['a', 'b', 'c', 'd'],
.....: columns=['one', 'two'])

In [103]:
df.describe()

            one       two
count  3.000000  2.000000
mean   3.083333 -2.900000
std    3.493685  2.262742
min    0.750000 -4.500000
25%    1.075000 -3.700000
50%    1.400000 -2.900000
75%    4.250000 -2.100000
max    7.100000 -1.300000

In [104]:
obj = pd.Series(['a', 'a', 'b', 'c'] * 4)

In [105]:
obj

0     a
1     a
2     b
3     c
4     a
5     a
6     b
7     c
8     a
9     a
10    b
11    c
12    a
13    a
14    b
15    c
dtype: object

In [106]:
obj.describe()

count     16
unique     3
top        a
freq       8
dtype: object

### 相关系数与协方差

Series的corr方法用于计算两个Series中重叠的、非NA的、按索引对齐的值的相关系数。与此类似，cov用于计算协方差

DataFrame的corr和cov方法将以DataFrame的形式分别返回完整的相关系数或协方差矩阵

利用DataFrame的corrwith方法，你可以计算其列或行跟另一个Series或DataFrame之间的相关系数。传入一个Series将会返回一个相关系数值Series（针对各列进行计算）

传入一个DataFrame则会计算按列名配对的相关系数。

### 唯一值、值计数以及成员资格

![](其他方法.jpg)

绘制DataFrame中多个相关列的一张柱状图

In [110]:
data = pd.DataFrame({'Qu1': [1, 3, 4, 3, 4],
.....: 'Qu2': [2, 3, 1, 2, 3],
.....: 'Qu3': [1, 5, 2, 4, 4]})

In [111]:
data

   Qu1  Qu2  Qu3
0    1    2    1
1    3    3    5
2    4    1    2
3    3    2    4
4    4    3    4

In [112]:
result = data.apply(pd.value_counts).fillna(0)

In [113]:
result

   Qu1  Qu2  Qu3
1  1.0  1.0  1.0
2  0.0  2.0  1.0
3  2.0  2.0  0.0
4  2.0  0.0  2.0
5  0.0  0.0  1.0

>结果中的行标签是所有列的唯一值。后面的频率值是每个列中这些值的相应计数。